id: 1ab65bed-0836-4125-95d8-56cd645299be
name: DNS lookups for commonly abused TLDs
description: |
  'Some top level domains (TLDs) are more commonly associated with malware for a range of 
  reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
  from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
  The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'
requiredDataConnectors: []
tactics:
  - CommandAndControl
  - Exfiltration
relevantTechniques:
  - T1483
  - T1008
  - T1048
query: |

  // Add additional TLDs to this list are required.
  let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
  imDns(domain_has_any=abusedTLD)
  | where DnsQuery has "." 
  | extend tld = tostring(split(DnsQuery, ".")[-1])
  | where tld in~ (abusedTLD)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), NameCount = count() by DnsQuery, SrcIpAddr, tld
  | order by NameCount desc
  | extend timestamp = StartTimeUtc, IPCustomEntity = SrcIpAddr

