Parser:
  Title: Palo Alto Network Sessions
  Version: '0.0'
  LastUpdated: June 20, 2021
Product:
  Name: PaloAlto
Normalization:
  Schema: NetworkSessions
  Version: '0.1.0'
References:
- Title: ASIM Network Session Schema
  Link: https://aka.ms/AzSentinelNetworkSessionDoc
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: |
  This Query Parser maps Palo Alto PanOS Firewall Events (CommonSecurityLogs) to the Azure Sentinel Information Model Network Session schema.
ParserName: vimNetworkSessionPaloAltoPanOS
ParserQuery: |
  let NetworkParserPaloAltoNetworks=(){
  CommonSecurityLog
  | where DeviceVendor=="Palo Alto Networks" and (Activity=="TRAFFIC" or (Activity=="THREAT" and DeviceEventClassID=="url"))
  | parse AdditionalExtensions with "PanOSDstPackets="DstPackets:long";PanOSsrc_packets="SrcPackets:long";start="EventStartTime:datetime";reason="*
  | project-rename 
        EventVendor=DeviceVendor
      , EventProduct=DeviceProduct
      , DvcHostname=DeviceName
      , NetworkApplicationProtocol=ApplicationProtocol
      , SrcZone=DeviceCustomString4 
      , DstZone=DeviceCustomString5
      , NetworkRuleName=DeviceCustomString1
      , NetworkProtocol=Protocol
      , SrcBytes=SentBytes
      , DstBytes=ReceivedBytes 
      , SrcUserUpn=SourceUserID
      ###
      , DstUserUpn=DestinationUserID 
      , EventProductVersion=DeviceVersion
      , EventSeverity=LogSeverity ##
      , NetworkPackets=DeviceCustomNumber2 ##
      , SrcNatIpAddr=SourceTranslatedAddress
      , DstNatIpAddr=DestinationTranslatedAddress
      , UrlCategory=DeviceCustomString2
      // Proxy
      , Url = RequestURL
      , HttpUserAgent = RequestClientApplication
      , HttpContentType = RequestContext
      , HttpRequestMethod = RequestMethod
  | extend
      NetworkBytes=tolong(FlexNumber1)
      , EventType="NetworkSession" // OK
      , EventCount=toint(1) // OK
      , EventResult=case(DeviceAction=="allow","Success","Failure") // OK
      , NetworkSessionId=tostring(DeviceCustomNumber1)
      , NetworkDuration=DeviceCustomNumber3
      , EventSchemaVersion="0.1.1" // OK 
  ////////////////////////////////////////////////////////
  // Mitigating LA Autocomplete
  | project-rename
        DvcMacAddr=DeviceMacAddress 
      , DstDvcHostname=DestinationHostName
      , DstMacAddr=DestinationMACAddress
    , SrcMacAddr=SourceMACAddress
    // Trivial renames to mitigate Autocomplete
      , NetworkDirection=CommunicationDirection
      , EventEndTime=EndTime
    , EventStartTime=EventStartTime
    , EventMessage=Message
    , TimeGenerated=TimeGenerated
      , DstIpAddr=DestinationIP
      , DstPortNumber=DestinationPort
      , DstNatPortNumber=DestinationTranslatedPort
    , SrcPortNumber=SourcePort
      , SrcIpAddr=SourceIP
      , DvcAction=DeviceAction
    , DstUserName=DestinationUserName
    , SrcNatPortNumber=SourceTranslatedPort
    , DvcOutboundInterface=DeviceOutboundInterface
    , DvcInboundInterface=DeviceInboundInterface
    , SrcUserName=SourceUserName 
  // parsed from additional extensions:
  | parse AdditionalExtensions with unparsedURL "PanOSActionFlags="ActionFlags
                                            ";cat="Category //https://knowledgebase.paloaltonetworks.com/KCSArticleDetail?id=kA10g000000ClmHCAS
                                          // ";PanOSXForwarderfor="HttpXff
                                          // ";PanOSReferer="Referer 
                                            ";"temp"l1="temp2"Gl4="temp3
                                            //";PanOSVsysName="VirtualSystem
                                            //";PanOSSrcUUID="SrcUUID
                                            //";PanOSDstUUID="DstUUID
                                            //";PanOSTunnelID="TunnelId
                                            //";PanOSMonitorTag="MonitorTag
                                            //";PanOSParentSessionID="ParentSessionId
                                            //";PanOSParentStartTime="ParentStartTime
                                            //";PanOSTunnelType="TunnelType
                                            ";PanOSThreatCategory="ThreatCategory
                                            ";PanOSContentVer="ContentVer
  // for EventClassIds=="url" it parses theses additional fields  
  | parse temp with "PanOSXForwarderfor="HttpRequestXff";PanOSReferer="HttpReferrerOriginal	";" *
  | extend UrlOriginal=coalesce(UrlOriginal, unparsedURL)
  | project-away temp, temp2, temp3, unparsedURL
  };
  NetworkParserPaloAltoNetworks
