Parser:
  Title: Cisco ASA Network Sessions
  Version: '0.2.0'
  LastUpdated: Aug 3, 2021
Product:
  Name: Cisco
Normalization:
  Schema: NetworkSessions
  Version: '0.2.0'
References:
- Title: ASIM Network Session Schema
  Link: https://aka.ms/AzSentinelNetworkSessionDoc
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: |
  This Query Parser maps Cisco ASA Events (CommonSecurityLogs) to the Azure Sentinel Information Model Network Session schema.
ParserName: vimNetworkSessionCiscoASA
ParserQuery: |
  let CiscoASA_Network_NormalizedParser=(){CommonSecurityLog 
    | where DeviceVendor == "Cisco" 
    | where DeviceProduct =="ASA"
    | where isnotempty(DeviceAction)
    | extend 
        EventSchemaVersion="0.2.0",
        EventCount=toint(1),
        EventVendor = "Cisco", 
        EventProduct = "ASA",
    | project-rename 
        DvcAction=DeviceAction,
        NetworkProtocol = Protocol, 
        EventMessage = Message, 
        SrcIpAddr=SourceIP,
        DstIpAddr=DestinationIP,
        DstPortNumber=DestinationPort,
        SrcPortNumber=SourcePort
  };
  CiscoASA_Network_NormalizedParser
